# InSessionPrintSetting Class

---
Represents the in-session Print Setup (Application Menu->Print->Print Setup) within Autodesk Revit.
SystemObject Autodesk.Revit.DBInSessionPrintSetting
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class InSessionPrintSetting : IPrintSetting,
    	IDisposable

    Public Class InSessionPrintSetting
    	Implements IPrintSetting, IDisposable

    public ref class InSessionPrintSetting : IPrintSetting,
    	IDisposable

    type InSessionPrintSetting =
        class
            interface IPrintSetting
            interface IDisposable
        end
The InSessionPrintSetting type exposes the following members.
| Name| Description
---|---|---
| PrintParameters| Returns the Parameters of Print Setup.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the InSessionPrintSetting
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
The in-session PrintSetting can't be stored in document.
#### Reference
Autodesk.Revit.DB Namespace